const year = +prompt('Введіть Ваш рік народження');
const city = prompt('В якому місті Ви живете?');
const sport = prompt('Який Ваш улюблений вид спорту?');
let finalText = '';


if (year && year < 2024 && year >= 1924) {
    const age = 2024 - year;
    finalText += `Твій вік ${age} роки(ів), `;
}
else {
    alert('Шкода, що Ви не захотіли ввести свій рік народження')
}

if (city) {
    if (city === 'Київ' && city) {
        finalText += `ти живеш у столиці України, `;
    } else if (city === 'Вашингтон' && city) {
        finalText += `ти живеш у столиці США, `;
    } else if (city === 'Лондон' && city) {
        finalText += `ти живеш у столиці Англії, `;
    } else {
        finalText += `ти живеш у місті ${city}, `;
    }
} else {
    alert('Шкода, що Ви не захотіли ввести місто у якому проживаєте');
}

if (sport) {
    if (sport === 'теніс') {
        finalText += 'Круто! Хочеш бути як Еліна Світоліна?';
    } else if (sport === 'фігурне катання') {
        finalText += 'Круто! Хочеш бути як Каорі Сакамото?';
    } else if (sport === 'художня гімнастика') {
        finalText += 'Круто! Хочеш бути як Дарʼя Варфоломеєв?';
    } else {
        alert(`Чим привернув твою увагу ${sport}?`);
    }
} else {
    alert('Шкода, що Ви не захотіли ввести свій улюблений вид спорту');
}

alert(finalText);


// switch (sport) {
//     case 'Теніс':
//         alert('Круто! Хочеш бути як Еліна Світоліна?');
//         break;
//     case 'Фігурне катання':
//         alert('Круто! Хочеш бути як Еліна Світоліна?');
//         break;
//     case 'Художня гімнастика':
//         alert('Круто! Хочеш бути як Еліна Світоліна?');
//         break;
//     default:
//         alert(`Чим привернув твою увагу ${sport}?`);
// }

