const year = +prompt('Введіть Ваш рік народження');
const city = prompt('В якому місті Ви живете?');
const sport = prompt('Який улюблений вид спорту?');


if (year && year < 2024 && year >= 1924) {
    const age = 2024 - year;
    alert(`Ваш вік ${age} років`);
}
else {
    alert('Помилка введення даних у полі рік народження')
}

if (city) {
    if (city === 'Київ' && city) {
        alert('Ти живеш у столиці України');
    } else if (city === 'Вашингтон' && city) {
        alert('Ти живеш у столиці США');
    } else if (city === 'Лондон' && city) {
        alert('Ти живеш у столиці Англії');
    } else {
        alert(`Ти живеш у місті ${city}`);
    }
} else {
    alert('Помилка введення даних у полі місто проживання');
}

if (sport) {
    if (sport === 'Теніс') {
        alert('Круто! Хочеш бути як Еліна Світоліна?');
    } else if (sport === 'Фігурне катання') {
        alert('Круто! Хочеш бути як Каорі Сакамото?');
    } else if (sport === 'Художня гімнастика') {
        alert('Круто! Хочеш бути як Дарʼя Варфоломеєв?');
    } else {
        alert(`Чим привернув твою увагу ${sport}?`);
    }
} else {
    alert('Помилка введення даних у полі улюблений вид спорту');
}

